# PANDAS23 Seleksi baris pada Data Frame dengan `query()`

## Cek Versi & Import Module

In [1]:
import pandas as pd

print(pd.__version__)

1.2.3

## Dataframe

In [2]:
d = {'kolom_satu':[1, 2, 3, 4, 5], 
     'kolom dua':[10, 20, 30, 40, 50]}
df = pd.DataFrame(d)
df

   kolom_satu  kolom dua
0           1         10
1           2         20
2           3         30
3           4         40
4           5         50

## Seleksi baris dengan query()

memilih baris dengan syarat tertentu(nilai data pada kolom_satu yang lebih besar dari 2)

In [3]:
df.query('kolom_satu > 2')

   kolom_satu  kolom dua
2           3         30
3           4         40
4           5         50

memilih baris dengan syarat tertentu(nilai data pada kolom_dua yang lebih kecil dari 30)

In [5]:
df.query('`kolom dua` < 30')

   kolom_satu  kolom dua
0           1         10
1           2         20